---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyOverconstraint
source: html/978979b5-8939-70d3-f38e-b314b344024a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyOverconstraint Property

Dimension overconstrains the Family.
 Cannot set Family Type to <None>.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyOverconstraint { get; }
```